Repository: Anum1225/lehrki
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, fr, it

source: Access denied. Teacher access required.
de: Zugriff verweigert. Lehrerzugang erforderlich.
fr: Accès refusé. Accès enseignant requis.
it: Accesso negato. Accesso insegnante richiesto.

source: Access denied. Admin access required.
de: Zugriff verweigert. Admin-Zugang erforderlich.
fr: Accès refusé. Accès administrateur requis.
it: Accesso negato. Accesso amministratore richiesto.

source: Premium subscription required for Parent Letter Generator.
de: Premium-Abonnement für Elternbrief-Generator erforderlich.
fr: Abonnement premium requis pour le générateur de lettres aux parents.
it: Abbonamento premium richiesto per il generatore di lettere ai genitori.

source: Insufficient tokens. Please upgrade your subscription.
de: Unzureichende Token. Bitte upgraden Sie Ihr Abonnement.
fr: Jetons insuffisants. Veuillez mettre à niveau votre abonnement.
it: Token insufficienti. Si prega di aggiornare l'abbonamento.

source: Please provide student context.
de: Bitte geben Sie den Schülerkontext an.
fr: Veuillez fournir le contexte de l'étudiant.
it: Si prega di fornire il contesto dello studente.

source: Parent letter generated successfully!
de: Elternbrief erfolgreich generiert!
fr: Lettre aux parents générée avec succès!
it: Lettera ai genitori generata con successo!

source: Error generating letter: {}
de: Fehler beim Generieren des Briefes: {}
fr: Erreur lors de la génération de la lettre: {}
it: Errore nella generazione della lettera: {}

source: Subscription activated successfully!
de: Abonnement erfolgreich aktiviert!
fr: Abonnement activé avec succès!
it: Abbonamento attivato con successo!

source: Subscription cancelled.
de: Abonnement storniert.
fr: Abonnement annulé.
it: Abbonamento annullato.

source: Error creating checkout session: {}
de: Fehler beim Erstellen der Checkout-Sitzung: {}
fr: Erreur lors de la création de la session de paiement: {}
it: Errore nella creazione della sessione di pagamento: {}

source: Error accessing billing portal: {}
de: Fehler beim Zugriff auf das Abrechnungsportal: {}
fr: Erreur d'accès au portail de facturation: {}
it: Errore nell'accesso al portale di fatturazione: {}

source: Message is required
de: Nachricht ist erforderlich
fr: Message requis
it: Messaggio richiesto

source: Chatbot is currently unavailable
de: Chatbot ist derzeit nicht verfügbar
fr: Le chatbot est actuellement indisponible
it: Il chatbot è attualmente non disponibile

source: Access denied.
de: Zugriff verweigert.
fr: Accès refusé.
it: Accesso negato.

source: Quiz submitted successfully!
de: Quiz erfolgreich eingereicht!
fr: Quiz soumis avec succès!
it: Quiz inviato con successo!

source: I'm sorry, I'm currently unavailable. Please try again later.
de: Es tut mir leid, ich bin derzeit nicht verfügbar. Bitte versuchen Sie es später erneut.
fr: Je suis désolé, je suis actuellement indisponible. Veuillez réessayer plus tard.
it: Mi dispiace, attualmente non sono disponibile. Riprova più tardi.

source: Welcome to LehrKI
de: Willkommen bei LehrKI
fr: Bienvenue sur LehrKI
it: Benvenuto su LehrKI

source: AI-Powered Educational Tools
de: KI-gestützte Bildungstools
fr: Outils éducatifs alimentés par l'IA
it: Strumenti educativi basati sull'IA

source: Dashboard
fr: Tableau de bord
it: Cruscotto

source: Parent Letter Generator
de: Elternbrief-Generator
fr: Générateur de lettres aux parents
it: Generatore di lettere ai genitori

source: Quiz Creator
de: Quiz-Ersteller
fr: Créateur de quiz
it: Creatore di quiz

source: Assessment Center
de: Bewertungszentrum
fr: Centre d'évaluation
it: Centro di valutazione

source: Subscription
de: Abonnement
fr: Abonnement
it: Abbonamento

source: Login
de: Anmelden
fr: Connexion
it: Accedi

source: Logout
de: Abmelden
fr: Déconnexion
it: Esci

source: Tokens
de: Token
fr: Jetons
it: Token

source: Settings
de: Einstellungen
fr: Paramètres
it: Impostazioni
